// Highly Detailed Password Threat Hunt For ALL sign in loging incidents
//Author: Ala Dabat
// Advanced L3 Detection Logic
SigninLogs
| where IPAddress == "193.143.1.4" // Replace with the specific IP address
| extend LoginStatus = case(
    ResultType == 0, "Successful",
    ResultType == 50155, "Device authentication failed",
    ResultType == 700016, "Application not found in directory",
    ResultType == 1400001, "Request nonce not provided",
    ResultType == 700084, "Refresh token expired for SPA",
    ResultType == 50055, "Password expired",
    ResultType == 530001, "Browser not supported",
    ResultType == 50088, "Limit on telecom MFA calls reached",
    ResultType == 50201, "Additional information required",
    ResultType == 130004, "UserPrincipal missing NGC key",
    ResultType == 7000112, "Application is disabled",
    ResultType == 50087, "Transient error during strong authentication",
    ResultType == 65004, "User declined app consent",
    ResultType == 500571, "Guest user account disabled",
    ResultType == 500113, "No reply address for application",
    ResultType == 90072, "User does not exist in tenant",
    ResultType == 50178, "User does not exist in tenant",
    ResultType == 900941, "Administrator consent required",
    ResultType == 500011, "Resource principal not found",
    ResultType == 50012, "Authentication failed",
    ResultType == 50074, "Strong Authentication required",
    ResultType == 70044, "Session expired due to sign-in frequency checks",
    ResultType == 530003, "Device management required",
    ResultType == 50126, "Invalid username or password",
    ResultType == 500121, "Authentication failed during strong authentication request",
    ResultType == 50097, "Device authentication is required",
    ResultType == 50072, "Enroll in multi-factor authentication required",
    ResultType == 9002341, "User is required to permit SSO",
    ResultType == 53010, "Cannot configure MFA methods due to organizational restrictions",
    ResultType == 501291, "Device registration required for MAM app access",
    ResultType == 65002, "Consent configuration issue between first-party application and resource",
    ResultType == 50014, "User redemption is pending",
    ResultType == 500142, "User redemption complete",
    ResultType == 70043, "Refresh token expired due to sign-in frequency checks",
    ResultType == 53009, "Application needs to enforce Intune protection policies",
    ResultType == 50078, "Expired multi-factor authentication",
    ResultType == 500141, "User redemption complete but request not initiated by target app",
    ResultType == 9002342, "User denied SSO permission",
    ResultType == 135011, "Device used during authentication is disabled",
    ResultType == 50206, "Consent required for target device connection",
    ResultType == 50206, "Consent required for target device connection",
    "Other") // Catch-all for any other ResultType values
| extend Remediation = case(
    LoginStatus == "Successful", "N/A",
    LoginStatus == "Device authentication failed", "Check device authentication settings and try again.",
    LoginStatus == "Application not found in directory", "Ensure the application is installed or consented to in the directory. Verify the correct tenant.",
    LoginStatus == "Request nonce not provided", "Ensure request nonce is provided for authentication.",
    LoginStatus == "Refresh token expired for SPA", "Redirect the user to the sign-in page for a refreshed session.",
    LoginStatus == "Password expired", "Offer the user an opportunity to reset their password. Admins can reset passwords via https://docs.microsoft.com/azure/active-directory/fundamentals/active-directory-users-reset-password-azure-portal",
    LoginStatus == "Browser not supported", "Require a compliant browser for accessing the resource. See supported browsers at https://docs.microsoft.com/azure/active-directory/conditional-access/technical-reference#supported-browsers",
    LoginStatus == "Limit on telecom MFA calls reached", "Wait a few minutes and try again.",
    LoginStatus == "Additional information required", "Prompt the user to provide additional information during login.",
    LoginStatus == "UserPrincipal missing NGC key", "Ensure the UserPrincipal has the NGC key configured.",
    LoginStatus == "Application is disabled", "Enable the application in the directory.",
    LoginStatus == "Transient error during strong authentication", "Attempt login again.",
    LoginStatus == "User declined app consent", "Have the user retry the sign-in and consent to the app.",
    LoginStatus == "Guest user account disabled", "Enable the guest user account.",
    LoginStatus == "No reply address for application", "Register a reply address for the application",
    LoginStatus == "User does not exist in tenant", "Add the user as an external user in the tenant.",
    LoginStatus == "Administrator consent required", "Grant administrator consent to the application.",
    LoginStatus == "Resource principal not found", "Ensure the resource principal is installed or consented to in the directory. Verify the correct tenant.",
    LoginStatus == "Authentication failed", "Ensure correct credentials and claims are provided.",
    LoginStatus == "Strong Authentication required", "Require multi-factor authentication for the user.",
    LoginStatus == "Session expired due to sign-in frequency checks", "Refresh the session or adjust sign-in frequency settings.",
    LoginStatus == "Device management required", "Enroll the device with a mobile device management (MDM) provider or use a compliant device.",
    LoginStatus == "Invalid username or password", "The user didn't enter the right credentials. It's expected to see some number of these errors in your logs due to users making mistakes.",
    LoginStatus == "User is required to permit SSO", "User must permit Single Sign-On (SSO) for authentication.",
    LoginStatus == "Cannot configure MFA methods due to organizational restrictions", "MFA methods cannot be configured due to organizational restrictions. Contact your administrator.",
    LoginStatus == "Device registration required for MAM app access", "Register the device to access the Mobile Application Management (MAM) app.",
    LoginStatus == "Consent configuration issue between first-party application and resource", "Resolve consent configuration between first-party application and resource.",
    LoginStatus == "User redemption is pending", "User's redemption is in a pending state. The guest user account is not fully created yet.",
    LoginStatus == "User redemption complete", "User's redemption is complete and the sign-in should continue.",
    LoginStatus == "Refresh token expired due to sign-in frequency checks", "The refresh token has expired or is invalid due to sign-in frequency checks by conditional access. The token was issued on {issueDate} and the maximum allowed lifetime for this request is {time}.",
    LoginStatus == "Application needs to enforce Intune protection policies", "Application needs to enforce Intune protection policies.",
    LoginStatus == "Expired multi-factor authentication", "Presented multi-factor authentication has expired due to policies configured by your administrator, you must refresh your multi-factor authentication to access '{resource}'.",
    LoginStatus == "User redemption complete but request not initiated by target app", "The user's redemption is complete but the request was not initiated by the target application.",
    LoginStatus == "User denied SSO permission", "User denied Single Sign-On (SSO) permission.",
    LoginStatus == "Device used during authentication is disabled", "Device used during the authentication is disabled.",
    LoginStatus == "Consent required for target device connection", "The user or administrator has not consented connecting to the target-device: '{identifier}'. Send an interactive authorization request for this user and target-machine.",
    "Visit the domain https://login.microsoftonline.com/error to check the result type.") // Remediation steps for 'Other' result types
| project TimeGenerated, UserPrincipalName, IPAddress, LoginStatus, Remediation, ResultType, ResultDescription, MfaDetail, AuthenticationDetails, AuthenticationMethodsUsed, Location, LocationDetails
